.section .rodata #read‑only data типа секция для чтения
msg: .asciz "hello world\n" # строка в в кодировке ASCII

.section .text # секция исполняемого кода
.globl main #видимость main (точка входа) для линковщика
main:
    subq    $40, %rsp       # вычитаем из указателя стека 40, чтобы выровнять согласно Windows x64 ABI
    leaq    msg(%rip), %rcx #%msg(%rip) - адрес метки msg относительно текущего значения регистра %rip, leaq  - загружает этот адрес в регистр rcx, 
                            # через rcx передаем первый аргумент в функцию
    call    printf          # читерим и вызываем функцию С
    xorq    %rax, %rax      # быстро обнуляем rax ,в котором лежит значение для выхода из функции и должны вернуть 0 из main как признак успеха
    addq    $40, %rsp       # добавляем 40 к указателю стека, чтобы восстановить исходное значение
    ret                     # берет rax и передает управление вызвавшей функции, а там у нас 0 и это успешное завершение
